// Menu
"About Hackintool" = "Про Hackintool";
"Check for Updates..." = "Check for Updates...";
"Preferences…" = "Параметри…";
"Services" = "Сервіси";
"Hide Hackintool" = "Сховати Hackintool";
"Hide Others" = "Сховати решту";
"Quit Hackintool" = "Завершити Hackintool";
"File" = "Файл";
"Open…" = "Відкрити…";
"Open Recent" = "Open Recent";
"Import" = "Import";
"Export" = "Export";
"IOReg Dump (Native)" = "IOReg Dump (Оригінальний)";
"IOReg Dump (Patched)" = "IOReg Dump (Патчений)";
"Clover config.plist" = "Clover config.plist";
"Framebuffer Text" = "Framebuffer Text";
"Framebuffer Binary" = "Framebuffer Binary";
"Edit" = "Редагування";
"Cut" = "Вирізати";
"Copy" = "Скопіювати";
"Paste" = "Вставити";
"Paste and Match Style" = "Вставити і допасувати стиль";
"Select All" = "Виділити все";
"Find" = "Пошук";
"Find…" = "Пошук…";
"Find and Replace…" = "Знайти і замінити…";
"Find Next" = "Знайти наступне";
"Find Previous" = "Знайти попереднє";
"Use Selection for Find" = "Використати виділене для пошуку";
"Jump to Selection" = "Перейти до виділеного";
"Spelling and Grammar" = "Правопис і граматика";
"Check Document Now" = "Перевірити документ зараз";
"Check Spelling While Typing" = "Перевіряти правопис під час введення";
"Check Grammar With Spelling" = "Перевіряти граматику із правописом";
"Correct Spelling Automatically" = "Виправляти правопис автоматично";
"Substitutions" = "Підстановки";
"Show Substitutions" = "Показати підстановки";
"Smart Copy/Paste" = "Розумне копіювання/вставлення";
"Smart Quotes" = "Розумні лапки";
"Smart Dashes" = "Розумні тире";
"Smart Links" = "Розумні посилання";
"Data Detectors" = "Розпізнавання даних";
"Text Replacement" = "Заміна даних";
"Transformations" = "Перетворення";
"Make Upper Case" = "У верхній регістр";
"Make Lower Case" = "У нижній регістр";
"Capitalize" = "Великі перші літери";
"Speech" = "Читання в голос";
"Start Speaking" = "Розпочати читання";
"Stop Speaking" = "Зупинити читання";
"Show Toolbar" = "Показати Панель інструментів";
"Hide Toolbar" = "Hide Toolbar";
"Customize Toolbar…" = "Редагувати Панель інструментів";
"View" = "Перегляд";
"Window" = "Вікно";
"Help" = "Довідка";
"Current Version" = "Поточна версія";
"System Configs" = "System Configs";
"Apply Current Patches" = "Застосувати патчі";
"Minimize" = "Згорнути";
"Zoom" = "Оптимізувати";
"Bring All to Front" = "Усі на перед";
"Hackintool Help" = "Довідка Hackintool";
// Tabs
"Intel" = "Intel";
"Clover" = "Clover";
"NVRAM" = "NVRAM";
"Installed" = "Installed";
"Display" = "Display";
"Audio" = "Audio";
"USB" = "USB";
"Disks" = "Disks";
"PCI" = "PCI";
"Info" = "Info";
"Power" = "Power";
"Calculator" = "Calculator";
"Tools" = "Tools";
"Logs" = "Logs";
// Intel
"Unlock" = "Unlock";
"Info" = "Info";
"VRAM" = "VRAM";
"Framebuffer" = "Framebuffer";
"Connectors" = "Connectors";
"Patch" = "Patch";
"Reload" = "Reload";
// Intel / General
"IntelGen:" = "IntelGen:";
"PlatformID:" = "PlatformID:";
"System Info:" = "System Info:";
"Model:" = "Model:";
"CPU:" = "CPU:";
"GPU Info:" = "GPU Info:";
"Vendor ID:" = "Vendor ID:";
"Device ID:" = "Device ID:";
"Metal:" = "Metal:";
"VDA Decoder:" = "VDA Decoder:";
"GPU:" = "GPU:";
"Model(s):" = "Model(s):";
// Intel / VRAM
"VRAM Info:" = "VRAM Info:";
"Stolen:" = "Stolen:";
"FBMem:" = "FBMem:";
"VRAM:" = "VRAM:";
"Max Stolen:" = "Max Stolen:";
"Total Stolen:" = "Total Stolen:";
"Total Cursor:" = "Total Cursor:";
"Max Overall:" = "Max Overall:";
// Intel / Framebuffer
"Framebuffer Info:" = "Framebuffer Info:";
"Framebuffer Flags:" = "Framebuffer Flags:";
"Name" = "Назва";
"Value" = "Значення";
// Intel / Connectors
"Connector Info:" = "Connector Info:";
"Index" = "Index";
"Bus ID" = "Bus ID";
"Pipe" = "Pipe";
"Type" = "Type";
"Flags" = "Flags";
"Connector Flags:" = "Connector Flags:";
"Display Info:" = "Display Info:";
"Internal" = "Internal";
"External" = "External";
"Name:" = "Name:";
"Port:" = "Port:";
"Product ID:" = "Product ID:";
"Serial No.:" = "Serial No.:";
"Internal:" = "Internal:";
// Intel / Patch
"Patch Options:" = "Patch Options:";
"General" = "Основні";
"Advanced" = "Додаткові";
"KextsToPatch (Hex)" = "KextsToPatch (Hex)";
"KextsToPatch (Base64)" = "KextsToPatch (Base64)";
"Devices / Properties" = "Devices / Properties";
"iASL DSL Source" = "iASL DSL Source";
"Auto Detect Changes" = "Auto Detect Changes";
"All" = "All";
"Audio" = "Audio";
"Use AllData Method" = "Use AllData Method";
"General Patch" = "Генерувати патч";
"Patch Output:" = "Patch Output:";
"DVMT pre-alloc 32 MB" = "DVMT pre-alloc 32 MB";
"Disable eGPU" = "Disable eGPU";
"DP -> HDMI" = "DP -> HDMI";
"Hotplug Reboot Fix" = "Hotplug Reboot Fix";
"Spoof Audio Device ID" = "Spoof Audio Device ID";
"VRAM 2048 MB" = "VRAM 2048 MB";
"Enable HDMI20 (4K)" = "Enable HDMI20 (4K)";
"GfxYTile Fix" = "GfxYTile Fix";
"USB Port Limit" = "USB Port Limit";
"FB Port Limit:" = "FB Port Limit:";
"Generate Patch" = "Generate Patch";
// Clover
"Clover Info:" = "Clover Info:";
"Current Booted Revision:" = "Поточна версія:";
"Last Installed Revision:" = "Встановлена версія:";
"Latest Available Revision:" = "Доступна оновлена версія:";
"Clover Patches:" = "Clover Patches:";
"Select" = "Select";
"Type" = "Type";
"Comment" = "Comment";
"Download Clover" = "Завантажити Clover";
"Refresh Clover" = "Оновити Clover";
"Apply Clover Patches" = "Apply Clover Patches";
// NVRAM
"NVRAM Variables:" = "NVRAM Variables:";
"Variable Value:" = "Variable Value:";
// Installed
"Select" = "Select";
"Installed Version" = "Installed Version";
"Current Version" = "Current Version";
"Download Version" = "Download Version";
"Superseder" = "Superseder";
"Description" = "Description";
"Url" = "Url";
"Compile Output:" = "Compile Output:";
"Download Selected" = "Download Selected";
"Compile Selected" = "Compile Selected";
"Install Kext(s)" = "Install Kext(s)";
"Rebuild KextCache and Repair Permissions" = "Rebuild KextCache and Repair Permissions";
// Display
"Displays:" = "Displays:";
"Name" = "Name";
"Vendor ID" = "Vendor ID";
"Product ID" = "Product ID";
"Serial No." = "Serial No.";
"Internal" = "Internal";
"Scaled Resolutions:" = "Scaled Resolutions:";
"Width" = "Width";
"Height" = "Height";
"Type" = "Type";
"Inject EDID:" = "Inject EDID:";
"Icon:" = "Icon:";
"Resolution:" = "Resolution:";
"Fix Monitor Ranges" = "Fix Monitor Ranges";
"Inject Apple Info" = "Inject Apple Info";
"Force RGB Mode" = "Force RGB Mode";
"Patch Color Profile" = "Patch Color Profile";
"Add" = "Додати";
"Delete" = "Видалити";
"Refresh" = "Оновити";
"Export" = "Експортувати";
// Audio
"Audio Devices:" = "Audio Devices:";
"Sub Device" = "Sub Device";
"Revision" = "Revision";
"Codec" = "Codec";
"Audio Info:" = "Audio Info:";
"Controller:" = "Controller:";
"Vendor:" = "Vendor:";
"Codec:" = "Codec:";
"Layout ID:" = "Layout ID:";
"Revisions:" = "Revisions:";
"Min Kernel:" = "Min Kernel:";
"Max Kernel:" = "Max Kernel:";
"Info" = "Info";
// USB
"USB Controllers:" = "USB Controllers:";
"Name" = "Name";
"Series" = "Series";
"Device ID" = "Device ID";
"Vendor ID" = "Vendor ID";
"USB Ports:" = "USB Ports:";
"Name" = "Name";
"Connector" = "Connector";
"Port" = "Port";
"Device" = "Device";
"Info" = "Info";
"Delete" = "Delete";
"Refresh" = "Refresh";
"Import" = "Import";
"Export" = "Export";
"Active Port" = "Active Port";
// Disks
"EFI Partitions:" = "EFI Partitions:";
"Device Name" = "Device Name";
"Partition Scheme:" = "Partition Scheme:";
"Volume Name" = "Volume Name";
"BSD Name" = "BSD Name";
"Mount Point" = "Mount Point";
"Disk Type" = "Disk Type";
"Mount" = "Mount";
"Unmount" = "Unmount";
"Open" = "Open";
"Boot EFI" = "Boot EFI";
// PCI
"PCI Devices:" = "PCI Devices:";
"Vendor" = "Vendor";
"Sub Vendor" = "Sub Vendor";
"Sub Device" = "Sub Device";
"Vendor Name" = "Vendor Name";
"Device Name" = "Device Name";
"Class" = "Class";
"Subclass" = "Subclass";
// Info
"Network Interfaces:" = "Network Interfaces:";
"Vendor " = "Vendor";
"Vendor Name" = "Vendor Name";
"Device Name" = "Device Name";
"BSD Name" = "BSD Name";
"Builtin" = "Builtin";
"Graphic Devices:" = "Graphic Devices:";
"Ports" = "Ports";
"Sub Device" = "Sub Device";
"Codec" = "Codec";
"Revision" = "Revision";
"Storage Devices:" = "Storage Devices:";
"Model" = "Model";
"Location" = "Location";
"Phy Block" = "Power Info:";
// Power
"Power Info:" = "Power Info:";
"Fix sleepimage" = "Fix sleepimage";
// Calculator
"Sequence:" = "Sequence:";
"Hex:" = "Hex:";
"Base64:" = "Base64:";
"ASCII:" = "ASCII:";
"Value:" = "Value:";
"Decimal:" = "Decimal:";
"Octal:" = "Octal:";
"Binary:" = "Binary:";
// Tools
"Tools Output:" = "Tools Output:";
"Get AppleIntelInfo" = "Get AppleIntelInfo";
"Install Kext for Atheros AR92xx/93xx WLan Cards (only 10.14+)" = "Install Kext for Atheros AR92xx/93xx WLan Cards (only 10.14+)";
"Install Kext to enable SATA HotPlug on Mojave" = "Install Kext to enable SATA HotPlug on Mojave";
"Generate Windows Bluetooth Registry File" = "Generate Windows Bluetooth Registry File";
// Log
"Log:" = "Лог:";
"Boot Log" = "Boot Log";
"Lilu (Log)" = "Lilu (Log)";
"Lilu (Kernel)" = "Lilu (Kernel)";
"WhateverGreen (Kernel)" = "WhateverGreen (Kernel)";
"AppleALC (Kernel)" = "AppleALC  (Kernel)";
"Search (⌘F)" = "Пошук (⌘F)";
// Import KextsToPatch
"Import KextsToPatch" = "Імпорт KextsToPatch";
"Find:" = "Пошук:";
"Replace:" = "Замінити:";
"Cancel" = "Скасувати";
"OK" = "Застосувати";
// Clover Updater
"Clover Updated" = "Оновити Clover";
"Downloading %@" = "Завантаження %@";
"No new Clover Revisions Are Avaliable at this Time!" = "Оновлення відсутні!";
"New Clover Revision %i is Available - you have %i. Would you like to download a newer Revision?" = "Доступна оновлена версія Clover %i поточна версія %i Бажаєте завантажити оновлення?";
"Not Now" = "Не зараз";
"Update..." = "Оновити...";
"Set Clover Installer Location" = "Змінити місце встановлення";
"An error occured while trying to download Clover installer!" = "Сталася помилка під час завантаження Clover!";
"%1.1f Mbytes" = "%1.1f Mbytes";
// Misc
"* You may require %@" = "* Вам може знадобитися %@";
"* You may require Spoof Audio Device ID" = "Вам може знадобитися Spoof Audio Device ID";
"Importing KextsToPatch" = "Імпортувати KextsToPatch";
"Are you sure you want to apply %d Clover patch(s)?" = "Are you sure you want to apply %d Clover patch(s)?";
"Patch Success!" = "Успішно!";
"Patch Fail!" = "Помилка!";
"Please select your existing config.plist to overwrite.\nData is written non-destructively and a backup will be created first." = "Виберіть config.plist для внесення змін.\n Дані будуть додані, але попередньо буде створено config-backup.plist";
"No Changes Detected!\r" = "Змін не виявлено!\r";
"Unknown" = "Невідомий";
"Mount Boot EFI Partition?" = "Підключити EFI?";
"Your Boot EFI Partition is not mounted." = "EFI не підключено";
"Mount" = "Підключити";
"Cancel" = "Скасувати";
"Buy me a Beer" = "Пожертвувати на пиво";
"Installing '%@'...\n" = "Installing '%@'...\n";
"Rebuilding KextCache and Repairing Permissions...\n" = "Rebuilding KextCache and Repairing Permissions...\n";
"\"%@\" doesn't exist. Do you want to create it?" = "\"%@\" doesn't exist. Do you want to create it?";
"\"%@\" does not exist. You can create a new one." = "\"%@\" does not exist. You can create a new one.";
"Warning!" = "Warning!";
"Enabling HWP (Intel Speed Shift) will require a reboot to restore the previous value." = "Enabling HWP (Intel Speed Shift) will require a reboot to restore the previous value.";
"Logging Intel registers may cause your system to crash." = "Logging Intel registers may cause your system to crash.";
"Logging CStates" = "Logging CStates";
"Perform CPU intensive activity..." = "Perform CPU intensive activity...";
"Fully Supported" = "Fully Supported";
"Not Supported" = "Not Supported";
